package itheima.java1.d07_oneclass.all.test8;

public class Test2 {
    public static void main(String[] args) {
        /*定义一个长度为3的数组，数组存储1~3名学生对象作为初始数据，学生对象的学号，姓名各不相同。
        学生的属性：学号，姓名，年龄。
        要求1：再次添加一个学生对象，并在添加的时候进行学号的唯一性判断。
        要求2：添加完毕之后，遍历所有学生信息。

        要求3：通过id删除学生信息
        如果存在，则删除，如果不存在，则提示删除失败。
        要求4：删除完毕之后，遍历所有学生信息。
        要求5：查询数组id为“heima002”的学生，如果存在，则将他的年龄+1岁*/



        //1.创建一个长度为3的数组


        //2.创建学生对象


        //3.把学生对象添加到数组当中



        //4.再次创建一个学生对象


        //5.唯一性判断
        //5.1 已存在 --- 提示重复
        //5.2 不存在 --- 添加学生对象



        //6.添加学生对象
        //6.1 老数组已经存满
        //6.2 老数组没有存满






    }
}